
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>为什么需要持续交付？ · Spinnaker 实践手册</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="阳明">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-base16-ateliersulphurpool.light.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../cloud_deployment_considerations/" />
    
    
    <link rel="prev" href="../preface/" />
    

    
        <link rel="shortcut icon" href='../favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"cnych/blockchain-handbook","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://blog.qikqiak.com" target="_blank" class="custom-link">阳明的博客</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">介绍</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface/">
            
                <a href="../preface/">
            
                    
                        <b>1.2.</b>
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">为什么需要持续交付？</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>2.1.</b>
                    
                    为什么需要持续交付？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">云部署注意事项</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../cloud_deployment_considerations/">
            
                <a href="../cloud_deployment_considerations/">
            
                    
                        <b>3.1.</b>
                    
                    云部署注意事项
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >为什么需要持续交付？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E3A;&#x4F55;&#x9700;&#x8981;&#x6301;&#x7EED;&#x4EA4;&#x4E92;&#xFF1F;">&#x4E3A;&#x4F55;&#x9700;&#x8981;&#x6301;&#x7EED;&#x4EA4;&#x4E92;&#xFF1F;</h1>
<p>&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x662F;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x8F6F;&#x4EF6;&#x66F4;&#x6539;&#x7684;&#x5B9E;&#x8DF5;&#x4EE5;&#x5FEB;&#x901F;&#xFF0C;&#x5B89;&#x5168;&#x548C;&#x81EA;&#x52A8;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x751F;&#x4EA7;&#x3002;</p>
<p>&#x5728;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x53D1;&#x5E03;&#x65B0;&#x529F;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x6027;&#x7684;&#x76DB;&#x4F1A;&#xFF0C;&#x516C;&#x53F8;&#x5185;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x5728;&#x4EE3;&#x7801;&#x51BB;&#x7ED3;&#x540E;&#x505C;&#x6B62;&#x5DE5;&#x4F5C;&#x6570;&#x5468;&#xFF0C;&#x5E76;&#x5728;&#x547D;&#x8FD0;&#x671F;&#x95F4;&#x7D27;&#x5F20;&#x5730;&#x56F4;&#x7ED5;&#x4EEA;&#x8868;&#x677F;&#x7B49;&#x5F85;&#x90E8;&#x7F72;&#x65F6;&#x95F4;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5411;&#x7528;&#x6237;&#x53D1;&#x5E03;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x5E94;&#x8BE5;&#x662F;&#x5E38;&#x89C4;&#x7684;&#xFF0C;&#x65E0;&#x804A;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4E00;&#x5929;&#x53EF;&#x4EE5;&#x53D1;&#x751F;&#x591A;&#x6B21;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63CF;&#x8FF0;&#x7EC4;&#x7EC7;&#x548C;&#x6280;&#x672F;&#x5B9E;&#x8DF5;&#x5B9E;&#x73B0;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5B83;&#x8BF4;&#x670D;&#x4F60;&#x7684;&#x597D;&#x5904;&#x66F4;&#x77ED;&#x7684;&#x53D1;&#x5E03;&#x5468;&#x671F;&#xFF0C;&#x5E76;&#x5E2E;&#x52A9;&#x60A8;&#x4E86;&#x89E3;&#x6587;&#x5316;&#x548C;&#x5B9E;&#x8DF5;&#x901A;&#x77E5;<code>Netflix</code>&#x548C;&#x5176;&#x4ED6;&#x7C7B;&#x4F3C;&#x7EC4;&#x7EC7;&#x7684;&#x4EA4;&#x4ED8;&#x6587;&#x5316;&#x3002;</p>
<h2 id="&#x957F;&#x90E8;&#x7F72;&#x5468;&#x671F;&#x7684;&#x95EE;&#x9898;">&#x957F;&#x90E8;&#x7F72;&#x5468;&#x671F;&#x7684;&#x95EE;&#x9898;</h2>
<p>&#x4F9D;&#x8D56;&#x6027;&#x6F02;&#x79FB;&#x3002; &#x7531;&#x4E8E;&#x672A;&#x90E8;&#x7F72;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x95F4;&#x8D8A;&#x6765;&#x8D8A;&#x957F;&#xFF0C;&#x5E93;&#x548C;&#x670D;&#x52A1;&#x53D6;&#x51B3;&#x4E8E;&#x7EE7;&#x7EED;&#x524D;&#x8FDB;&#x3002; &#x5F53;&#x5B83;&#x6765;&#x7684;&#x65F6;&#x5019;&#x90E8;&#x7F72;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x6E38;&#x7684;&#x5E93;&#x7248;&#x672C;&#x5177;&#x6709;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x95EE;&#x9898;&#x6539;&#x53D8;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x6240;&#x8C08;&#x8BBA;&#x7684;&#x670D;&#x52A1;&#x4E0D;&#x518D;&#x5177;&#x6709;&#x8BE5;&#x517C;&#x5BB9;&#x7684;API&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x4E5F;&#x7EE7;&#x7EED;&#x524D;&#x8FDB;&#x3002;&#x4E00;&#x65E6;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#x5B8C;&#x6210;&#x5F00;&#x53D1;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x4F1A;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x503E;&#x5411;&#x4E8E;&#x4E0B;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6216;&#x4E00;&#x7EC4;&#x529F;&#x80FD;&#x3002; &#x4FE1;&#x606F;&#x662F;&#x5728;&#x521B;&#x4F5C;&#x8005;&#x7684;&#x5934;&#x8111;&#x4E2D;&#x4E0D;&#x518D;&#x662F;&#x65B0;&#x9C9C;&#x4E8B;&#x7269;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x56DE;&#x53BB;&#x8C03;&#x67E5;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x516D;&#x4E2A;&#x6708;&#x6216;&#x4E00;&#x5E74;&#x524D;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x901A;&#x8FC7;&#x5927;&#x91CF;&#x53D1;&#x5E03;&#xFF0C;&#x9694;&#x79BB;&#x548C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x6765;&#x6E90;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x4F7F;&#x8FD9;&#x66F4;&#x5BB9;&#x6613;&#xFF1F; &#x6211;&#x4EEC;&#x66F4;&#x9891;&#x7E41;&#x5730;&#x53D1;&#x5E03;</p>
<h2 id="&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x7684;&#x597D;&#x5904;">&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x7684;&#x597D;&#x5904;</h2>
<p>&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x6D88;&#x9664;&#x4E86;&#x8F6F;&#x4EF6;&#x53D1;&#x5E03;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5178;&#x793C;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x51E0;&#x4E2A;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li><p>&#x9769;&#x65B0;</p>
<p>  &#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x786E;&#x4FDD;&#x4E86;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x66F4;&#x5FEB;&#x4E0A;&#x5E02;&#x65F6;&#x95F4;&#xFF0C;&#x4FEE;&#x6539;&#x53D8;&#x66F4;&#xFF0C;&#x5B9E;&#x9A8C;&#x548C;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x3002;&#x79EF;&#x6781;&#x7684;&#x53D1;&#x5E03;&#x8282;&#x594F;&#x786E;&#x4FDD;&#x8FC5;&#x901F;&#x4FEE;&#x590D;&#x7834;&#x788E;&#x7684;&#x4E8B;&#x60C5;&#x5E76;&#x786E;&#x4FDD;&#x7528;&#x6237;&#x6EE1;&#x610F;&#x7684;&#x65B0;&#x65B9;&#x5F0F;&#x5728;&#x51E0;&#x5929;&#x5185;&#x5230;&#x8FBE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#x3002;</p>
</li>
<li><p>&#x66F4;&#x5FEB;&#x7684;&#x53CD;&#x9988;&#x5FAA;&#x73AF;</p>
<p>  &#x7ECF;&#x5E38;&#x90E8;&#x7F72;&#x7684;&#x8F83;&#x5C0F;&#x66F4;&#x6539;&#x53EF;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x901A;&#x8FC7;&#x91C7;&#x7528;&#x6DF7;&#x6C8C;&#x5DE5;&#x7A0B;&#x6216;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x6280;&#x672F;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x91D1;&#x4E1D;&#x96C0;&#x5206;&#x6790;&#x5230;&#x4EA4;&#x4ED8;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#xFF0C;&#x66F4;&#x5FEB;&#xFF0C;&#x66F4;&#x6709;&#x6548;&#x5730;&#x4FEE;&#x590D;&#x3002;</p>
</li>
<li><p>&#x63D0;&#x9AD8;&#x53EF;&#x9760;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;</p>
<p>  &#x4E3A;&#x4E86;&#x5FEB;&#x901F;&#x53D1;&#x5E03;&#xFF0C;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x9F13;&#x52B1;&#x5DE5;&#x5177;&#x53D6;&#x4EE3;&#x624B;&#x52A8;&#x5177;&#x6709;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x7684;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x7684;&#x6D41;&#x7A0B;&#x3002;&#x8FDE;&#x7EED;&#x8F93;&#x9001;&#x7BA1;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x5236;&#x4F5C;&#x7EBF;&#x6761;&#x4EE5;&#x5728;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x9010;&#x6E10;&#x5C55;&#x5F00;&#x66F4;&#x6539;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x4E91;&#x76EE;&#x6807;&#x3002;&#x5B89;&#x5168;&#x7684;&#x90E8;&#x7F72;&#x5B9E;&#x8DF5;&#x53EF;&#x4EE5;&#x5D4C;&#x5165;&#x5230;
&#x91CA;&#x653E;&#x8FC7;&#x7A0B;&#x5E76;&#x51CF;&#x5C11;&#x6076;&#x52A3;&#x90E8;&#x7F72;&#x7684;&#x7206;&#x70B8;&#x534A;&#x5F84;&#x3002;</p>
</li>
<li><p>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x6548;&#x7387;&#x548C;&#x6548;&#x7387;</p>
<p>  &#x66F4;&#x9891;&#x7E41;&#x7684;&#x53D1;&#x5E03;&#x8282;&#x594F;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x5C11;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#x6E38;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x52A0;&#x5FEB;&#x63D0;&#x4EA4;&#x548C;&#x90E8;&#x7F72;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x95EE;&#x9898;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#x5BF9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x8BCA;&#x65AD;&#x548C;&#x53CD;&#x5E94;&#x4ED6;&#x4EEC;&#x7684;&#x5934;&#x8111;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x4ED6;&#x4EEC;&#x90E8;&#x7F72;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x66F4;&#x5F3A;&#x70C8;&#x7684;&#x5F52;&#x5C5E;&#x611F;&#x548C;&#x66F4;&#x5C11;&#x7684;&#x8D23;&#x5907;&#x611F;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x4E86;&#x3002;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x5BFC;&#x81F4;&#x9AD8;&#x7EE9;&#x6548;&#xFF0C;&#x66F4;&#x5FEB;&#x4E50;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;</p>
</li>
</ul>
<h2 id="&#x6709;&#x6548;&#x5B9E;&#x8DF5;">&#x6709;&#x6548;&#x5B9E;&#x8DF5;</h2>
<p>&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x53D8;&#x5316;&#x7684;&#x63A8;&#x8FDB;&#xFF0C;&#x9519;&#x8BEF;&#x548C;&#x4E0D;&#x517C;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x4ECB;&#x7ECD;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3002;&#x542F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x9891;&#x7E41;&#x7684;&#x53D8;&#x5316;&#x662F;&#x6295;&#x8D44;&#x652F;&#x6301;&#x5177;&#x6709;&#x66F4;&#x597D;&#x5DE5;&#x5177;&#xFF0C;&#x5B9E;&#x8DF5;&#xFF0C;&#x548C;&#x6587;&#x5316;&#x3002;
&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x6280;&#x672F;&#x548C;&#x539F;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;
&#x91C7;&#x7528;&#x8FDE;&#x7EED;&#x4EA4;&#x4ED8;&#x5B9E;&#x8DF5;&#xFF1A;</p>
<ul>
<li><p>&#x9F13;&#x52B1;&#x81EA;&#x7ED9;&#x81EA;&#x8DB3;</p>
<p>  &#x4E0D;&#x8981;&#x5C06;&#x90E8;&#x7F72;&#x8FC7;&#x7A0B;&#x59D4;&#x6D3E;&#x7ED9;&#x4E13;&#x95E8;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x5141;&#x8BB8;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x8D1F;&#x8D23;&#x90E8;&#x7F72;&#x548C;&#x652F;&#x6301;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x81EA;&#x5DF1;&#x53D1;&#x5E03;&#x3002;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x81EA;&#x52A9;&#x5F0F;&#x5DE5;&#x5177;&#x548C;&#x6388;&#x6743;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5F53;&#x4ED6;&#x4EEC;&#x611F;&#x89C9;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x63A8;&#x52A8;&#x4EE3;&#x7801;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x521B;&#x65B0;&#xFF0C;&#x68C0;&#x6D4B;&#x548C;&#x54CD;&#x5E94;&#x3002;</p>
</li>
<li><p>&#x81EA;&#x52A8;&#x5316;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;</p>
<p>  &#x5728;&#x6784;&#x5EFA;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x53D1;&#x5E03;&#x548C;&#x63A8;&#x5E7F;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#x90FD;&#x5145;&#x5206;&#x652F;&#x6301;&#x81EA;&#x52A8;&#x5316;
&#x5FAA;&#x73AF;&#x964D;&#x4F4E;&#x4E86;&#x4FDD;&#x7BA1;&#x90E8;&#x7F72;&#x8FC7;&#x7A0B;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x3002;</p>
</li>
<li><p>&#x4F7F;&#x5176;&#x53EF;&#x89C1;</p>
<p>  &#x6539;&#x5584;&#x65E0;&#x6CD5;&#x89C2;&#x5BDF;&#x7684;&#x4E8B;&#x7269;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x6574;&#x5408;&#x4E0D;&#x540C;&#x8D26;&#x6237;&#xFF0C;&#x5730;&#x533A;&#x548C;&#x5730;&#x533A;&#x7684;&#x6240;&#x6709;&#x4E91;&#x8D44;&#x6E90;&#x5C06;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x6574;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x8DDF;&#x8E2A;&#x548C;&#x8C03;&#x8BD5;&#x4EFB;&#x4F55;&#x89C6;&#x56FE;&#x9053;&#x8FD8;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x8F7B;&#x677E;&#x5B8C;&#x6210;&#x8DDF;&#x8E2A;&#x5982;&#x4F55;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6B65;&#x9AA4;&#x4E2D;&#x63A8;&#x5E7F;&#x795E;&#x5668;&#x3002;</p>
</li>
</ul>
<ul>
<li><p>&#x8BA9;&#x5B83;&#x5BB9;&#x6613;&#x505A;&#x5230;</p>
<p>  &#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x9700;&#x8981;&#x4E13;&#x5BB6;&#x7EA7;&#x7684;&#x77E5;&#x8BC6;&#x624D;&#x80FD;&#x5236;&#x5B9A;&#x4E91;&#x90E8;&#x7F72;&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4EE5;&#x4FBF;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x5E76;&#x6539;&#x8FDB;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6D41;&#x7A0B;&#x5BF9;&#x91C7;&#x7528;&#x5408;&#x7EA6;&#x6709;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#x7EC6;&#x81F4;&#x7684;&#x8FD0;&#x9001;&#x3002;</p>
</li>
<li><p>&#x67CF;&#x6CB9;&#x8DEF;</p>
<p>  &#x8BF4;&#x670D;&#x56E2;&#x961F;&#x63A5;&#x53D7;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x65F6;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x7684;&#x73B0;&#x6210;&#x6A21;&#x677F;&#x3002;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x5C01;&#x88C5;&#x7684;&#x201C;&#x94FA;&#x8BBE;&#x9053;&#x8DEF;&#x201D;&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x201C;&#x9EC4;&#x91D1;&#x9053;&#x8DEF;&#x201D;&#xFF09;&#x5E0C;&#x671B;&#x90E8;&#x7F72;&#x5230;&#x4E91;&#x7AEF;&#x7684;&#x56E2;&#x961F;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF08;&#x56FE;1-1&#xFF09;&#x3002;&#x4E00;&#x6837;&#x66F4;&#x591A;&#x7684;&#x56E2;&#x961F;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x4F5C;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#x7684;&#x53CD;&#x9988;&#x5FAA;&#x73AF;&#x53D8;&#x5F97;&#x53EF;&#x4F9B;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x4F7F;&#x7528;&#x3002; &#x6700;&#x597D;&#x5B9E;&#x8DF5;&#x4F1A;&#x53D8;&#x5F97;&#x5177;&#x6709;&#x4F20;&#x67D3;&#x6027;&#x3002;
  <img src="../images/1-1.png" alt="1-1">
  &#x56FE;1-1. <code>Netflix</code>&#x8F6F;&#x4EF6;&#x53D1;&#x5E03;&#x7684;&#x9053;&#x8DEF;&#x3002;&#x7B2C;&#x4E00;&#x884C;&#x663E;&#x793A;&#x6B65;&#x9AA4;&#xFF0C;&#x4ECE;&#x4EE3;&#x7801;&#x7B7E;&#x5165;&#x5230;&#x6D41;&#x91CF;&#xFF0C;&#x5E95;&#x90E8;&#x7684;&#x884C;&#x663E;&#x793A;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x5728;<code>Netflix</code>&#x6BCF;&#x4E00;&#x6B65;&#x3002;</p>
</li>
</ul>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x5728;&#x8FC1;&#x79FB;&#x5230;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x5E73;&#x53F0;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x56E0;&#x90E8;&#x7F72;&#x4E0D;&#x5F53;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x548C;&#x4E2D;&#x65AD;&#x6570;&#x91CF;&#x660E;&#x663E;&#x51CF;&#x5C11;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5168;&#x529B;&#x6295;&#x5165;<code>Spinnaker</code>&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x5E2E;&#x52A9;&#x63A8;&#x8FDB;&#x8FD9;&#x4E9B;&#x5B9E;&#x8DF5;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x90E8;&#x7F72;&#x76F8;&#x5173;&#x95EE;&#x9898;&#x7684;&#x666E;&#x904D;&#x51CF;&#x5C11;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; qikqiak.com 2018 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Updated: 
2018-06-11 17:03:58
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../preface/" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../cloud_deployment_considerations/" class="navigation navigation-next " aria-label="Next page: 云部署注意事项">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"为什么需要持续交付？","level":"2.1","depth":1,"next":{"title":"云部署注意事项","level":"3.1","depth":1,"path":"cloud_deployment_considerations/README.md","ref":"cloud_deployment_considerations/README.md","articles":[]},"previous":{"title":"前言","level":"1.2","depth":1,"path":"preface/README.md","ref":"preface/README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["prism","prism-themes","-highlight","github","codesnippet","splitter","simple-page-toc","page-toc-button","image-captions","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","theme-default","3-ba","ga"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © qikqiak.com 2018","modify_label":"Updated: ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-base16-ateliersulphurpool.light.css"]},"github":{"url":"https://github.com/cnych/blockchain-handbook"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"cnych/blockchain-handbook","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"xxxxxxxx"},"ga":{"configuration":"auto","token":"UA-XXXX-Y"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"阳明","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"index.html#fig1.1.1","level":"1.1","list_caption":"Figure: https://www.spinnaker.io/ebook/cover.png","alt":"https://www.spinnaker.io/ebook/cover.png","nro":1,"url":"https://www.spinnaker.io/ebook/cover.png","index":1,"caption_template":"_CAPTION_","label":"https://www.spinnaker.io/ebook/cover.png","attributes":{},"skip":false,"key":"1.1.1"}]},"title":"Spinnaker 实践手册","language":"zh-hans","links":{"sidebar":{"阳明的博客":"https://blog.qikqiak.com"}},"gitbook":"*","description":"Spinnaker 官方 ebook ContinuousDeliveryWithSpinnaker.pdf 中文翻译"},"file":{"path":"why_continuous_delivery/README.md","mtime":"2018-06-11T09:03:58.245Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-17T01:31:04.884Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

