
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>云部署注意事项 · Spinnaker 实践手册</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="阳明">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-base16-ateliersulphurpool.light.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../why_continuous_delivery/" />
    

    
        <link rel="shortcut icon" href='../favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"cnych/blockchain-handbook","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://blog.qikqiak.com" target="_blank" class="custom-link">阳明的博客</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">介绍</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface/">
            
                <a href="../preface/">
            
                    
                        <b>1.2.</b>
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">为什么需要持续交付？</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../why_continuous_delivery/">
            
                <a href="../why_continuous_delivery/">
            
                    
                        <b>2.1.</b>
                    
                    为什么需要持续交付？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">云部署注意事项</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>3.1.</b>
                    
                    云部署注意事项
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >云部署注意事项</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E91;&#x90E8;&#x7F72;&#x6CE8;&#x610F;&#x4E8B;&#x9879;">&#x4E91;&#x90E8;&#x7F72;&#x6CE8;&#x610F;&#x4E8B;&#x9879;</h1>
<p>&#x65E0;&#x8BBA;&#x662F;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x5EFA;&#x9879;&#x76EE;&#xFF0C;&#x8FD8;&#x662F;&#x8BA1;&#x5212;&#x5C06;&#x590D;&#x6742;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x4E2D;&#xFF0C;&#x56F4;&#x7ED5;&#x8F6F;&#x4EF6;&#x90E8;&#x7F72;&#x548C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x67B6;&#x6784;&#x7684;&#x9009;&#x62E9;&#x90FD;&#x4F1A;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7A33;&#x5065;&#x6027;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#x548C;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x89C4;&#x6A21;&#x65E2;&#x6307;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5904;&#x7406;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x4E5F;&#x6307;&#x7EC4;&#x7EC7;&#x4E2D;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x56E2;&#x961F;&#x548C;&#x670D;&#x52A1;&#x7684;&#x6570;&#x91CF;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x3002;</p>
<p>&#x524D;&#x4E00;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x8FDE;&#x7EED;&#x4EA4;&#x4ED8;&#x5BF9;&#x7EC4;&#x7EC7;&#x6709;&#x76CA;&#x3002;&#x5B83;&#x8FD8;&#x6DB5;&#x76D6;&#x4E86;&#x5728;&#x8003;&#x8651;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x65F6;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x4E9B;&#x5B9E;&#x8DF5;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x8D35;&#x7EC4;&#x7EC7;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x57FA;&#x672C;&#x8003;&#x8651;&#x56E0;&#x7D20;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x8F6F;&#x4EF6;&#x6210;&#x529F;&#x90E8;&#x7F72;&#x5230;&#x4E91;&#x4E2D;&#x3002;&#x5728;&#x60A8;&#x9009;&#x62E9;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x7B56;&#x7565;&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x9700;&#x8981;&#x5728;&#x60A8;&#x7684;&#x7EC4;&#x7EC7;&#x4E2D;&#x6709;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x9879;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x5C55;&#x793A;&#x8FD9;&#x4E9B;&#x9677;&#x9631;&#xFF0C;&#x5E76;&#x5C06;&#x793E;&#x533A;&#x548C;Netflix&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x4F5C;&#x4E3A;&#x6F5C;&#x5728;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x5C55;&#x793A;&#x3002;&#x5728;&#x5EFA;&#x7ACB;&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x5C06;&#x4E86;&#x89E3;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E8B;&#x9879;&#x3002;</p>
<h2 id="&#x8BC1;&#x4E66;&#x7BA1;&#x7406;">&#x8BC1;&#x4E66;&#x7BA1;&#x7406;</h2>
<p>&#x9996;&#x5148;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x5982;&#x4F55;&#x5728;&#x4E91;&#x4E2D;&#x7BA1;&#x7406;&#x51ED;&#x8BC1;&#x3002; &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x660E;&#x667A;&#x7684;&#x6A21;&#x56E0;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF0C;&#x4E91;&#x5C31;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x7535;&#x8111;&#x3002; &#x5728;&#x5B58;&#x50A8;&#x654F;&#x611F;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x5C0F;&#x5FC3;&#xFF0C;&#x4F46;&#x5728;&#x4F7F;&#x7528;&#x79DF;&#x7528;&#x7684;&#x5171;&#x4EAB;&#x786C;&#x4EF6;&#x7247;&#x65F6;&#x5C24;&#x5176;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x8EAB;&#x4EFD;&#x548C;&#x8BBF;&#x95EE;&#x7BA1;&#x7406;&#xFF08;IAM&#xFF09;&#x670D;&#x52A1;&#x6709;&#x52A9;&#x4E8E;&#x5B9E;&#x73B0;&#x89D2;&#x8272;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x5206;&#x914D;&#xFF0C;&#x4F7F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x5B89;&#x5168;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x9759;&#x6001;&#x90E8;&#x7F72;&#x51ED;&#x8BC1;&#xFF0C;&#x8FD9;&#x4E9B;&#x51ED;&#x8BC1;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x76D7;&#x53D6;&#x4E14;&#x96BE;&#x4EE5;&#x8DDF;&#x8E2A;&#x3002; &#x5C3D;&#x7BA1;IAM&#x53EA;&#x6709;&#x8FD9;&#x4E48;&#x8FDC;&#x3002; &#x5F88;&#x53EF;&#x80FD;&#xFF0C;&#x60A8;&#x7684;&#x81F3;&#x5C11;&#x90E8;&#x5206;&#x670D;&#x52A1;&#x9700;&#x8981;&#x4E0E;&#x5185;&#x90E8;&#x6216;&#x7B2C;&#x4E09;&#x65B9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9B;&#x5E94;&#x5546;&#x8FD0;&#x8425;&#x7684;&#x5DF2;&#x9A8C;&#x8BC1;&#x670D;&#x52A1;&#x901A;&#x8BDD;&#x3002; &#x6570;&#x636E;&#x5E93;&#x5BC6;&#x7801;&#xFF0C;<code>GitHub</code>&#x4EE4;&#x724C;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8BC1;&#x4E66;&#x548C;&#x79C1;&#x94A5;&#x90FD;&#x5E94;&#x8BE5;&#x5728;&#x9759;&#x6001;&#x548C;&#x7F51;&#x7EDC;&#x4E2D;&#x52A0;&#x5BC6;&#xFF0C;&#x654F;&#x611F;&#x7684;&#x5BA2;&#x6237;&#x6570;&#x636E;&#x4E5F;&#x5E94;&#x8BE5;&#x5982;&#x6B64;&#x3002; &#x8BC1;&#x4E66;&#x5E94;&#x5B9A;&#x671F;&#x8F6E;&#x6362;&#x5E76;&#x5177;&#x6709;&#x7ECF;&#x8FC7;&#x6D4B;&#x8BD5;&#x7684;&#x64A4;&#x9500;&#x65B9;&#x6CD5;&#x3002;</p>
<p><code>Google</code>&#x7684;&#x4E91;&#x5BC6;&#x94A5;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x6EE1;&#x8DB3;&#x4E86;<code>Google&#x4E91;&#x7AEF;&#x5E73;&#x53F0;&#xFF08;GCP&#xFF09;</code>&#x5BA2;&#x6237;&#x7684;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#x3002; &#x4E9A;&#x9A6C;&#x900A;&#x7684;&#x5BC6;&#x94A5;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x5C06;&#x5BC6;&#x94A5;&#x5B58;&#x50A8;&#x5728;&#x786C;&#x4EF6;&#x5B89;&#x5168;&#x6A21;&#x5757;&#xFF08;HSM&#xFF09;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x989D;&#x5916;&#x7684;&#x7269;&#x7406;&#x5B89;&#x5168;&#x5C42;&#xFF0C;&#x4F46;&#x5176;&#x8303;&#x56F4;&#x4EC5;&#x9650;&#x4E8E;&#x5BC6;&#x94A5;&#x5B58;&#x50A8;&#x548C;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x7840;&#x3002; <code>Kubernetes</code>&#x7684;&#x79D8;&#x5BC6;&#x7CFB;&#x7EDF;&#x4E13;&#x6CE8;&#x4E8E;&#x50A8;&#x5B58;&#x548C;&#x5206;&#x914D;&#x5230;&#x5BB9;&#x5668;&#x3002;<code>HashiCorp</code>&#x7684;<code>Vault</code>&#x662F;&#x4E00;&#x6B3E;&#x5907;&#x53D7;&#x597D;&#x8BC4;&#x7684;&#x5F00;&#x6E90;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x79D8;&#x5BC6;&#x548C;&#x8BC1;&#x4E66;&#x7BA1;&#x7406;&#xFF0C;&#x529F;&#x80FD;&#x9F50;&#x5168;&#xFF0C;&#x53EF;&#x5728;&#x4EFB;&#x4F55;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x9009;&#x62E9;&#x8FD8;&#x662F;&#x6784;&#x5EFA;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x90FD;&#x8981;&#x8003;&#x8651;&#x5B83;&#x5C06;&#x5982;&#x4F55;&#x4E0E;&#x60A8;&#x7684;&#x8F6F;&#x4EF6;&#x4EA4;&#x4ED8;&#x6D41;&#x7A0B;&#x96C6;&#x6210;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5FAE;&#x578B;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x6240;&#x9700;&#x7684;&#x6700;&#x5C0F;&#x6743;&#x9650;&#x96C6;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x9700;&#x8981;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x79D8;&#x5BC6;&#x3002;</p>
<h2 id="&#x533A;&#x57DF;&#x9694;&#x79BB;">&#x533A;&#x57DF;&#x9694;&#x79BB;</h2>
<p>&#x7B2C;&#x4E8C;&#x4EF6;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x5730;&#x533A;&#x9694;&#x79BB;&#x3002;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x503E;&#x5411;&#x4E8E;&#x5C06;&#x5176;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7EC4;&#x7EC7;&#x5230;&#x53EF;&#x5BFB;&#x5740;&#x7684;&#x533A;&#x57DF;&#x548C;&#x533A;&#x57DF;&#x3002;&#x533A;&#x57DF;&#x662F;&#x7269;&#x7406;&#x6570;&#x636E;&#x4E2D;&#x5FC3;;&#x9760;&#x8FD1;&#x7684;&#x51E0;&#x4E2A;&#x533A;&#x57DF;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x63A5;&#x8FD1;&#x6027;&#xFF0C;&#x8DE8;&#x540C;&#x4E00;&#x533A;&#x57DF;&#x5185;&#x7684;&#x533A;&#x57DF;&#x7684;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x975E;&#x5E38;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x533A;&#x57DF;&#x53EF;&#x4EE5;&#x5927;&#x9646;&#x5206;&#x5F00;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5EF6;&#x8FDF;&#x6BD4;&#x76F8;&#x90BB;&#x533A;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x91CF;&#x7EA7;&#x8981;&#x5927;&#x3002;</p>
<p>&#x6700;&#x5065;&#x58EE;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x4E2A;&#x533A;&#x57DF;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x8DE8;&#x5730;&#x533A;&#x5171;&#x4EAB;&#x76F8;&#x5173;&#x6027;&#x3002;</p>
<blockquote>
<p>&#x7B80;&#x5355;&#x7684;&#x6545;&#x969C;&#x60C5;&#x666F;
&#x91C7;&#x53D6;&#x5728;&#x533A;&#x57DF;1&#xFF0C;&#x533A;&#x57DF;2&#x548C;&#x533A;&#x57DF;3&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x4E8B;&#x6545;&#x6216;&#x8F6F;&#x4EF6;&#x9519;&#x8BEF;&#x4F7F;&#x533A;&#x57DF;1&#x8131;&#x673A;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x7528;&#x6237;&#x5F71;&#x54CD;&#x5E94;&#x8BE5;&#x662F;&#x589E;&#x52A0;&#x90A3;&#x4E9B;&#x8DDD;&#x79BB;&#x533A;&#x57DF;1&#x6700;&#x8FD1;&#x7684;&#x7528;&#x6237;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x8BF7;&#x6C42;&#x73B0;&#x5728;&#x8DEF;&#x7531;&#x5230;&#x66F4;&#x8FDC;&#x7684;&#x533A;&#x57DF;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x5F88;&#x5C11;&#x50CF;&#x5C06;&#x670D;&#x52A1;&#x548C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x533A;&#x57DF;&#x4E00;&#x6837;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x80FD;&#x5F88;&#x6602;&#x8D35;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7B80;&#x5355;&#x6545;&#x969C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x4E2D;&#x552F;&#x4E00;&#x7684;&#x7528;&#x6237;&#x5F71;&#x54CD;&#x662F;&#x7531;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5F15;&#x8D77;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x5730;&#x533A;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5BB9;&#x91CF;&#x51C6;&#x5907;&#x597D;&#x5904;&#x7406;&#x6765;&#x81EA;&#x533A;&#x57DF;1&#x7684;&#x7A81;&#x7136;&#x6D8C;&#x5165;&#x7684;&#x7528;&#x6237;&#x3002;&#x51B7;&#x85CF;&#x5E93;&#x6CA1;&#x6709;&#x5F15;&#x5165;&#x989D;&#x5916;&#x7684;&#x5EF6;&#x8FDF;&#x6216;&#x5BFC;&#x81F4;[...]</p>
<p>&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x7EC4;&#x7EC7;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x7406;&#x60F3;&#x5E76;&#x4E0D;&#x73B0;&#x5B9E;&#x3002;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x63A5;&#x53D7;&#x4E00;&#x4E9B;&#x53EF;&#x7528;&#x6027;&#x548C;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x964D;&#x4F4E;&#xFF0C;&#x800C;&#x201C;&#x6551;&#x4E16;&#x4E3B;&#x201D;&#x5730;&#x533A;&#x81EA;&#x52A8;&#x7F29;&#x653E;&#x670D;&#x52A1;&#x4EE5;&#x54CD;&#x5E94;&#x4E22;&#x5931;&#x7684;&#x533A;&#x57DF;&#x53EF;&#x4EE5;&#x5BFC;&#x81F4;&#x663E;&#x7740;&#x7684;&#x6210;&#x672C;&#x8282;&#x7701;&#x3002;&#x5E76;&#x975E;&#x6240;&#x6709;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x90FD;&#x975E;&#x5E38;&#x9002;&#x5408;&#x591A;&#x533A;&#x57DF;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6240;&#x6709;&#x533A;&#x57DF;&#x90FD;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x5199;&#x5165;&#x4E3B;&#x4EBA;&#x3002;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x4E8E;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x6765;&#x5C4F;&#x853D;&#x8F83;&#x6162;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4EE5;&#x9632;&#x6B62;&#x8D1F;&#x8F7D;&#x5CF0;&#x503C;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x603B;&#x4F53;&#x5EF6;&#x8FDF;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x540E;&#x4EE5;10&#xFF05;&#x6BCF;&#x79D2;&#x8BF7;&#x6C42;&#x6570;&#xFF08;RPS&#xFF09;&#x8BFB;&#x53D6;&#x67E5;&#x8BE2;&#xFF0C;&#x547D;&#x4E2D;&#x7387;&#x4E3A;90&#xFF05;&#x3002;&#x5982;&#x679C;&#x5931;&#x8D25;&#x533A;&#x57DF;&#x7684;&#x7528;&#x6237;&#x6D8C;&#x5165;100k RPS&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#xFF0C;&#x5BFC;&#x81F4;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#x5E76;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF1F;&#x5982;&#x679C;&#x60A8;&#x8003;&#x8651;&#x90E8;&#x7F72;&#x66F4;&#x591A;&#x7684;&#x5B9E;&#x4F8B;&#x6765;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x6545;&#x969C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x5BF9;&#x4E8E;&#x8BC4;&#x4F30;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x7684;&#x516C;&#x53F8;&#x5C1A;&#x672A;&#x8FBE;&#x5230;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x4E2A;&#x5730;&#x533A;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x64CD;&#x4F5C;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x8BF7;&#x90E8;&#x7F72;&#x670D;&#x52A1;&#x4EE5;&#x5BB9;&#x8BB8;&#x60A8;&#x6240;&#x9009;&#x533A;&#x57DF;&#x5185;&#x53D1;&#x751F;&#x533A;&#x57DF;&#x6545;&#x969C;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#x6216;&#x6602;&#x8D35;&#x3002;&#x7531;&#x4E8E;&#x8DE8;&#x533A;&#x57DF;&#x7684;&#x4F4E;&#x5EF6;&#x8FDF;&#xFF0C;&#x652F;&#x6301;&#x540C;&#x6B65;&#x590D;&#x5236;&#x6216;&#x57FA;&#x4E8E;&#x6CD5;&#x5B9A;&#x6570;&#x91CF;&#x64CD;&#x4F5C;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x8D35;&#x7EC4;&#x7EC7;&#x5728;&#x533A;&#x57DF;&#x5197;&#x4F59;&#x65B9;&#x9762;&#x62E5;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x533A;&#x57DF;&#x5185;&#x7684;&#x533A;&#x57DF;&#x5197;&#x4F59;&#x53D8;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4E0D;&#x518D;&#x6210;&#x4E3A;&#x95EE;&#x9898;&#x3002; &#x53D7;&#x5230;&#x533A;&#x57DF;&#x6545;&#x969C;&#x5F71;&#x54CD;&#x7684;&#x533A;&#x57DF;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x4E3A;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x533A;&#x57DF;&#x6545;&#x969C;&#x7684;&#x6D41;&#x91CF;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002; &#x64A4;&#x79BB;&#x9000;&#x5316;&#x5730;&#x533A;&#x7684;&#x4EA4;&#x901A;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x540E;&#x7EED;&#x95EE;&#x9898;&#x66F4;&#x5BB9;&#x6613;&#x56DE;&#x5E94;&#x3002;</p>
<h2 id="&#x81EA;&#x52A8;&#x7F29;&#x653E;">&#x81EA;&#x52A8;&#x7F29;&#x653E;</h2>
<p>&#x7B2C;&#x4E09;&#x4EF6;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x81EA;&#x52A8;&#x7F29;&#x653E;&#x3002;&#x81EA;&#x52A8;&#x7F29;&#x653E;&#x6216;&#x52A8;&#x6001;&#x534F;&#x8C03;&#x662F;&#x4E91;&#x672C;&#x5730;&#x8BA1;&#x7B97;&#x7684;&#x57FA;&#x7840;&#x3002;&#x5982;&#x679C;<code>Kubernetes Pod</code>&#x6216;<code>AWS</code>&#x5B9E;&#x4F8B;&#x80CC;&#x540E;&#x7684;&#x7269;&#x7406;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x66F4;&#x6362;&#x8BE5;<code>Pod</code>&#x6216;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E0D;&#x8FDB;&#x884C;&#x5E72;&#x9884;&#x3002;&#x901A;&#x8FC7;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x7684;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x6269;&#x5C55;&#xFF0C;&#x81EA;&#x52A8;&#x8C03;&#x8282;&#x7A0B;&#x5E8F;&#x5728;&#x7A33;&#x5B9A;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x4E0B;&#x4FDD;&#x6301;&#x53EF;&#x7528;&#x6027;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x968F;&#x7740;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x7684;&#x53D8;&#x5316;&#x800C;&#x6269;&#x5C55;&#x6216;&#x7F29;&#x51CF;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x6BD4;&#x7ECF;&#x5E38;&#x6295;&#x5165;&#x5904;&#x7406;&#x9AD8;&#x5CF0;&#x6D41;&#x91CF;&#x6216;&#x6F5C;&#x5728;&#x9AD8;&#x5CF0;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x66F4;&#x5177;&#x6210;&#x672C;&#x6548;&#x76CA;&#x3002;</p>
<p>&#x5E73;&#x6ED1;&#x7684;&#x81EA;&#x52A8;&#x8C03;&#x8282;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5728;&#x8D1F;&#x8F7D;&#x4E0B;&#x7684;&#x884C;&#x4E3A;&#x65B9;&#x5F0F;&#xFF0C;&#x542F;&#x52A8;&#x7279;&#x5F81;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5BF9;&#x4E0B;&#x6E38;&#x670D;&#x52A1;&#x7684;&#x8D44;&#x6E90;&#x9700;&#x6C42;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x63A5;&#x53D7;2,000&#x4E2A;&#x5E76;&#x53D1;&#x8FDE;&#x63A5;&#x7684;&#x5C0F;&#x578B;<code>MySQL</code>&#x96C6;&#x7FA4;&#xFF0C;&#x5E76;&#x4E14;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;30&#x4E2A;&#x8FDE;&#x63A5;&#x7684;&#x6C60;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x8BA9;&#x8BE5;&#x670D;&#x52A1;&#x7684;&#x89C4;&#x6A21;&#x8D85;&#x8FC7;66&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x5728;&#x590D;&#x6742;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#x53EF;&#x80FD;&#x66F4;&#x96BE;&#x4EE5;&#x786E;&#x5B9A;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6269;&#x5C55;&#x7B56;&#x7565;&#x4F1A;&#x5BF9;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;&#x5EA6;&#x91CF;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x4F8B;&#x5982;&#x5B9E;&#x4F8B;&#x95F4;&#x7684;&#x5E73;&#x5747;CPU&#x5229;&#x7528;&#x7387;&#x3002;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x4E0A;&#x9650;&#x548C;&#x4E0B;&#x9650;&#xFF1F;&#x670D;&#x52A1;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#x7684;CPU&#x5229;&#x7528;&#x7387;&#x7EA7;&#x522B;&#x56E0;&#x670D;&#x52A1;&#x800C;&#x5F02;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x3002;&#x5386;&#x53F2;&#x6307;&#x6807;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x5F53;&#x4E0A;&#x4E2A;&#x661F;&#x671F;&#x5929;CPU&#x5229;&#x7528;&#x7387;&#x8FBE;&#x5230;70&#xFF05;&#xFF0C;&#x7B2C;99&#x767E;&#x5206;&#x4F4D;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x8FBE;&#x5230;1500&#x6BEB;&#x79D2;&#x65F6;&#x201D;&#xFF09;&#xFF0C;&#x4F46;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x4EE5;&#x5916;&#x7684;&#x56E0;&#x7D20;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;CPU&#x5229;&#x7528;&#x7387;&#x3002;&#x5728;<code>Netflix</code>&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x613F;&#x610F;&#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x6324;&#x538B;&#x6D4B;&#x8BD5;&#x7684;&#x751F;&#x4EA7;&#x5B9E;&#x9A8C;&#x6765;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x662F;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x8DEF;&#x7531;&#x5230;&#x5355;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x8BF7;&#x6C42;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53D7;&#x5230;&#x4E25;&#x5BC6;&#x76D1;&#x63A7;&#x3002;
&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x5B9A;&#x671F;&#x5728;&#x4E00;&#x5929;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x6D4B;&#x8BD5;&#x3002;&#x4E5F;&#x8BB8;&#x5B9A;&#x671F;&#x586B;&#x5145;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x4F1A;&#x51CF;&#x5C11;&#x67D0;&#x4E9B;&#x9762;&#x5411;&#x7528;&#x6237;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x7684;&#x6700;&#x5927;&#x541E;&#x5410;&#x91CF;&#xFF1F;&#x5168;&#x7403;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x5E94;&#x8BE5;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x533A;&#x72EC;&#x7ACB;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x53EF;&#x80FD;&#x56E0;&#x56FD;&#x5BB6;&#x4E0D;&#x540C;&#x800C;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7528;&#x4E8E;CPU&#x5229;&#x7528;&#x7387;&#x7684;&#x6307;&#x6807;&#x90FD;&#x5177;&#x6709;&#x8BEF;&#x5BFC;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x5E74;&#x90FD;&#x5728;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#x3002;Brendan Gregg&#xFF0C;&#x201C;CPU&#x5229;&#x7528;&#x7387;&#x4E0D;&#x5BF9;&#x201D;1</p>
</blockquote>
<p>&#x57FA;&#x4E8E;CPU&#x5229;&#x7528;&#x7387;&#x7684;&#x7F29;&#x653E;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6309;&#x9884;&#x671F;&#x8FD0;&#x884C;&#x3002;&#x7279;&#x5B9A;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x53EF;&#x4EE5;&#x5BFC;&#x81F4;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x548C;&#x66F4;&#x4E00;&#x81F4;&#x7684;&#x6269;&#x5C55;&#x7B56;&#x7565;&#xFF0C;&#x4F8B;&#x5982;&#x79EF;&#x538B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x8BF7;&#x6C42;&#x6570;&#x91CF;&#xFF0C;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8BF7;&#x6C42;&#x82B1;&#x8D39;&#x6392;&#x961F;&#x6216;&#x603B;&#x4F53;&#x8BF7;&#x6C42;&#x5EF6;&#x8FDF;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x65E0;&#x8BBA;&#x8C03;&#x6574;&#x7B56;&#x7565;&#x7684;&#x6548;&#x679C;&#x5982;&#x4F55;&#xFF0C;&#x5982;&#x679C;&#x90E8;&#x5206;&#x5E94;&#x7528;&#x7531;&#x4E8E;&#x5197;&#x957F;&#x7684;&#x9884;&#x70ED;&#x65F6;&#x95F4;&#x6216;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x60C5;&#x51B5;&#x800C;&#x542F;&#x52A8;&#x7F13;&#x6162;&#xFF0C;&#x81EA;&#x52A8;&#x8C03;&#x8282;&#x5BF9;&#x7A81;&#x53D1;&#x6027;&#x8D1F;&#x8F7D;&#x5CF0;&#x503C;&#xFF08;&#x5982;&#x7A81;&#x53D1;&#x65B0;&#x95FB;&#xFF09;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5E2E;&#x52A9;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x670D;&#x52A1;&#x9700;&#x8981;15&#x5206;&#x949F;&#x624D;&#x80FD;&#x542F;&#x52A8;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x7A81;&#x7136;&#x53D1;&#x751F;&#x4EA4;&#x901A;&#x9AD8;&#x5CF0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53CD;&#x5E94;&#x5F0F;&#x81EA;&#x52A8;&#x8C03;&#x8282;&#x529F;&#x80FD;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5E2E;&#x52A9;&#x3002;&#x5728;<code>Netflix</code>&#xFF0C;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E86;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x9884;&#x6D4B;&#x6027;&#x81EA;&#x52A8;&#x8C03;&#x8282;&#x5668;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x6700;&#x8FD1;&#x7684;&#x6D41;&#x91CF;&#x6A21;&#x5F0F;&#x548C;&#x5B63;&#x8282;&#x6027;&#x6765;&#x9884;&#x6D4B;&#x5173;&#x952E;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x653E;&#x6162;&#x89C4;&#x6A21;&#x7684;&#x670D;&#x52A1;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x5BB9;&#x91CF;&#x3002;</p>
<h2 id="&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x6301;&#x4E45;&#x6027;">&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x6301;&#x4E45;&#x6027;</h2>
<p>&#x7B2C;&#x56DB;&#x4EF6;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x6301;&#x4E45;&#x6027;&#x3002;&#x516C;&#x5171;&#x4E91;&#x9996;&#x6B21;&#x4F7F;&#x5F97;&#x4E0D;&#x53EF;&#x53D8;&#x670D;&#x52A1;&#x5668;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x800C;<code>Netflix</code>&#x5219;&#x5F88;&#x5FEB;&#x63A5;&#x53D7;&#x4E86;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x3002; &#x4E0E;&#x5176;&#x534F;&#x8C03;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x5B89;&#x88C5;&#x6700;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x6216;OS&#x66F4;&#x65B0;&#xFF0C;&#x65B0;&#x7684;&#x673A;&#x5668;&#x6620;&#x50CF;&#x662F;&#x4ECE;&#x57FA;&#x672C;&#x6620;&#x50CF;&#xFF08;&#x5305;&#x542B;&#x6700;&#x65B0;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4FEE;&#x8865;&#x7A0B;&#x5E8F;&#x548C;&#x57FA;&#x7840;&#x5143;&#x7D20;&#xFF09;&#x6784;&#x5EFA;&#x800C;&#x6210;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x8981;&#x90E8;&#x7F72;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7248;&#x672C;&#x3002; &#x90E8;&#x7F72;&#x65B0;&#x4EE3;&#x7801;&#xFF1F; &#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F62;&#x8C61;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x7528;&#x4E8E;&#x4E91;&#x90E8;&#x7F72;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x4E0D;&#x53EF;&#x53D8;&#x670D;&#x52A1;&#x5668;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x96C6;&#x88C5;&#x7BB1;&#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x81EA;&#x7136;&#x800C;&#x7136;&#x3002; &#x7531;&#x4E8E;Docker&#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x65B0;&#x7684;&#x5305;&#x683C;&#x5F0F;&#x6765;&#x4EE3;&#x66FF;RPM&#x6216;dpkg&#xFF0C;&#x56E0;&#x6B64;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#xFF1A;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#xFF1F; &#x4E0D;&#x53D8;&#x6027;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x7B49;&#x6301;&#x4E45;&#x6027;&#x670D;&#x52A1;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x6311;&#x6218;&#x3002; &#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x652F;&#x6301;&#x591A;&#x4E2A;&#x5199;&#x4E3B;&#x7AD9;&#x6216;&#x96F6;&#x505C;&#x673A;&#x4E3B;&#x7AD9;&#x6545;&#x969C;&#x5207;&#x6362;&#xFF1F; &#x4EC0;&#x4E48;&#x662F;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#x4EE5;&#x53CA;&#x5B83;&#x53EF;&#x4EE5;&#x591A;&#x5FEB;&#x5730;&#x590D;&#x5236;&#x5230;&#x65B0;&#x5B9E;&#x4F8B;&#xFF1F; &#x7F51;&#x7EDC;&#x5757;&#x5B58;&#x50A8;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x65B0;&#x5B9E;&#x4F8B;&#x7684;&#x5728;&#x7EBF;&#x5FEB;&#x7167;&#x53EF;&#x80FD;&#x7F29;&#x77ED;&#x590D;&#x5236;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x672C;&#x5730;NVMe&#x5B58;&#x50A8;&#x53EF;&#x80FD;&#x5BF9;&#x5EF6;&#x8FDF;&#x654F;&#x611F;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x66F4;&#x6709;&#x610F;&#x4E49;&#x3002; &#x4E00;&#x4E9B;&#x6301;&#x4E45;&#x6027;&#x670D;&#x52A1;&#x7684;&#x786E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x76F4;&#x63A5;&#x7684;&#x9014;&#x5F84;&#x6765;&#x5B9E;&#x73B0;&#x4E0D;&#x53EF;&#x66FF;&#x4EE3;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x4F46;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x70B9;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x672C;&#x8FC7;&#x9AD8;&#x3002;</p>
<h2 id="&#x670D;&#x52A1;&#x53D1;&#x73B0;">&#x670D;&#x52A1;&#x53D1;&#x73B0;</h2>
<p>&#x7B2C;&#x4E94;&#x4EF6;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x3002; &#x670D;&#x52A1;&#x53D1;&#x73B0;&#x662F;&#x4E91;&#x5FAE;&#x670D;&#x52A1;&#x901A;&#x5E38;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x62D3;&#x6251;&#x4E2D;&#x627E;&#x5230;&#x5F7C;&#x6B64;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x7279;&#x70B9;&#x548C;&#x590D;&#x6742;&#x6027;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002; &#x5F53;<code>Netflix</code>&#x7B2C;&#x4E00;&#x6B21;&#x8FDB;&#x5165;AWS&#x65F6;&#xFF0C;&#x7F3A;&#x4E4F;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;<code>Eureka</code>&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x8868;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x8BE5;&#x6CE8;&#x518C;&#x8868;&#x4E8E;2012&#x5E74;&#x5F00;&#x653E;&#x3002;&#x5C24;&#x91CC;&#x5361;&#x4ECD;&#x7136;&#x662F;<code>Netflix</code>&#x73AF;&#x5883;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x4E0E;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7684;&#x5FAE;&#x670D;&#x52A1;<code>RPC</code>&#x548C;&#x8D1F;&#x8F7D;&#x7D27;&#x5BC6;&#x96C6;&#x6210;&#x5E73;&#x8861;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; &#x5C3D;&#x7BA1;&#x7B2C;&#x4E09;&#x65B9;<code>Eureka</code>&#x5BA2;&#x6237;&#x7AEF;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;<code>Eureka</code>&#x672C;&#x8EAB;&#x662F;&#x7528;<code>Java</code>&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;JVM&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#x6700;&#x4F73;&#x96C6;&#x6210;&#x3002;<code>Netflix</code>&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x8BED;&#x8A00;&#x73AF;&#x5883;&#xFF0C;&#x975E;JVM&#x670D;&#x52A1;&#x901A;&#x5E38;&#x4E0E;&#x4E00;&#x4E2A;&#x4E0E;<code>Eureka</code>&#x4EA4;&#x8C08;&#x7684;Java&#x8FB9;&#x8F66;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x5C06;&#x8BF7;&#x6C42;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5230;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x5DF2;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x3002; Kubernetes&#x901A;&#x8FC7;&#x5176;&#x670D;&#x52A1;&#x548C;&#x7AEF;&#x70B9;&#x7684;&#x6982;&#x5FF5;&#x63D0;&#x4F9B;&#x4E86;&#x5B83;&#x6240;&#x7BA1;&#x7406;&#x7684;&#x670D;&#x52A1;&#x6240;&#x9700;&#x7684;&#x4E00;&#x5207;&#x3002; &#x4E9A;&#x9A6C;&#x900A;&#x7684;&#x5E94;&#x7528;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF08;ALB&#xFF09;&#x6BD4;&#x539F;&#x6765;&#x7684;<code>Elastic Load Balancer</code>&#x4EA7;&#x54C1;&#x66F4;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x4E2D;&#x95F4;&#x5C42;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002; &#x5982;&#x679C;&#x60A8;&#x7684;&#x90E8;&#x7F72;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;ALB&#x6CE8;&#x518C;&#xFF08;<code>Spinnaker</code>&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#xFF09;&#x5E76;&#x4E14;&#x4F7F;&#x7528;<code>Route53</code>&#x4E3A;ALB&#x5730;&#x5740;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5219;&#x60A8;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x60A8;&#x53EF;&#x80FD;&#x90FD;&#x9700;&#x8981;&#x3002;</p>
<p><code>Netflix</code>&#x7684;<code>Eureka</code>&#x4E0E;&#x5176;&#x4ED6;<code>Netflix</code>&#x8FD0;&#x884C;&#x65F6;&#x5E73;&#x53F0;&#xFF08;&#x4E5F;&#x4E3B;&#x8981;&#x9488;&#x5BF9;JVM&#xFF09;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x96C6;&#x6210;&#x4E86;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;RPC&#x4F20;&#x8F93;&#x548C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#xFF0C;&#x65AD;&#x8DEF;&#xFF0C;&#x56DE;&#x9000;&#xFF0C;&#x901F;&#x7387;&#x9650;&#x5236;&#x548C;&#x51CF;&#x8F7D;&#xFF0C;&#x4E3A;&#x91D1;&#x4E1D;&#x96C0;&#x52A8;&#x6001;&#x5B9A;&#x5236;&#x7684;&#x8BF7;&#x6C42;&#x8DEF;&#x7531;&#x548C; &#x6324;&#x538B;&#x6D4B;&#x8BD5;&#xFF0C;&#x6307;&#x6807;&#x6536;&#x96C6;&#x548C;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x4EE5;&#x53CA;&#x6545;&#x969C;&#x6CE8;&#x5165;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5BF9;&#x4E8E;&#x6784;&#x5EFA;&#x548C;&#x8FD0;&#x884C;&#x5065;&#x58EE;&#x7684;&#x5173;&#x952E;&#x4E1A;&#x52A1;&#x4E91;&#x670D;&#x52A1;&#x90FD;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;
&#x8BB8;&#x591A;&#x8F83;&#x65B0;&#x7684;&#x5F00;&#x6E90;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x9879;&#x76EE;&#xFF08;&#x5982;<code>Linkerd</code>&#x548C;<code>Envoy</code>&#xFF09;&#x90FD;&#x7531;<code>CNCF</code>&#x6258;&#x7BA1;&#xFF0C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x4E86;&#x4E0E;<code>Netflix</code>&#x8FD0;&#x884C;&#x65F6;&#x5E73;&#x53F0;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x670D;&#x52A1;&#x7F51;&#x683C;&#x5C06;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x4E0E;&#x521A;&#x521A;&#x63D0;&#x5230;&#x7684;&#x9AD8;&#x7EA7;RPC&#x529F;&#x80FD;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x540C;&#x65F6;&#x4F5C;&#x4E3A;&#x8BED;&#x8A00;&#x548C;&#x73AF;&#x5883;&#x4E0D;&#x53EF;&#x77E5;&#x8BBA;&#x8005;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; qikqiak.com 2018 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Updated: 
2018-06-11 17:23:32
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../why_continuous_delivery/" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 为什么需要持续交付？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"云部署注意事项","level":"3.1","depth":1,"previous":{"title":"为什么需要持续交付？","level":"2.1","depth":1,"path":"why_continuous_delivery/README.md","ref":"why_continuous_delivery/README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["prism","prism-themes","-highlight","github","codesnippet","splitter","simple-page-toc","page-toc-button","image-captions","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","theme-default","3-ba","ga"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © qikqiak.com 2018","modify_label":"Updated: ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-base16-ateliersulphurpool.light.css"]},"github":{"url":"https://github.com/cnych/blockchain-handbook"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"cnych/blockchain-handbook","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"xxxxxxxx"},"ga":{"configuration":"auto","token":"UA-XXXX-Y"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"阳明","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"index.html#fig1.1.1","level":"1.1","list_caption":"Figure: https://www.spinnaker.io/ebook/cover.png","alt":"https://www.spinnaker.io/ebook/cover.png","nro":1,"url":"https://www.spinnaker.io/ebook/cover.png","index":1,"caption_template":"_CAPTION_","label":"https://www.spinnaker.io/ebook/cover.png","attributes":{},"skip":false,"key":"1.1.1"}]},"title":"Spinnaker 实践手册","language":"zh-hans","links":{"sidebar":{"阳明的博客":"https://blog.qikqiak.com"}},"gitbook":"*","description":"Spinnaker 官方 ebook ContinuousDeliveryWithSpinnaker.pdf 中文翻译"},"file":{"path":"cloud_deployment_considerations/README.md","mtime":"2018-06-11T09:23:32.360Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-17T01:31:04.884Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

